# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "oven-sh/bun"

# Core Tools
brew "git"
brew "openssh"
brew "tree"
brew "curl"
brew "wget"

# Build Tools
brew "make"
brew "gcc"
brew "cmake"
brew "pkg-config"
brew "autoconf"
brew "automake"

# Development Tools
brew "fzf"
brew "bat"
brew "eza"
brew "htop"
brew "ripgrep"
brew "fd"
brew "neovim"
brew "tmux"
brew "zoxide"
brew "tldr"
brew "jq"
brew "gh"

# Container Tools
brew "docker"
brew "docker-compose"
brew "kubectl"
brew "helm"
brew "minikube"

# Languages and Runtimes
brew "python"
brew "pyenv"
brew "go"
brew "openjdk"
brew "node"
brew "deno"
brew "oven-sh/bun/bun"

# Cloud CLI Tools
brew "awscli"
brew "azure-cli"

# Utility Tools
brew "stow"
brew "direnv"
brew "asdf"
brew "starship"
brew "gum"
brew "atuin"
brew "yq"
brew "httpie"
brew "ngrok"
brew "mkcert"
brew "nss"
brew "mas"

# Desktop Applications
cask "alacritty"
cask "arc"
cask "bitwarden"
cask "brave-browser"
cask "cursor"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "github"
cask "google-chrome"
cask "loom"
cask "microsoft-edge"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "obsidian"
cask "postman"
cask "raycast"
cask "rectangle"
cask "slack"
cask "zed"
cask "zoom"
cask "dotnet-sdk"

# Mac App Store apps (requires mas CLI)
# Uncomment the apps you want to install
# mas "Xcode", id: 497799835
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
